# n, m = map(int, input().split())
# while n <= m:
#     s = n ** 2
#     n += 1
#     print(s, end=' ')
# ////////////////////////////////////////////////////////

# x = float(input())
# i = 1
# s = x
# while i < 10:
#     s += x
#     i += 1
#     print(s, end=' ')

# ////////////////////////////////////////////////////////
# n = int(input())
# a = 1
# i = 3
# while i <= n:
#     a *= 2
#     i += 3
# print(a)
# ////////////////////////////////////////////////////////

# n = 999
# i = 0
# while i <= n:
#     if i > 100:
#         if i % 47 == 43 and i % 3 == 0:
#             print(i, end=' ')
#     i += 1
#
#
# n = 99
# while n < 1000:
#     n += 3
#     if n % 47 == 43:
#         print(n, end=' ')
#
# i = 100
# j = 999
# while i <= j:
#     while i % 47 == 43:
#         while i % 3 == 0:
#             print(i, end=' ')
#             i += 1
#         i += 1
#
#     i += 1


# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

ed, exp = 10000, 12000

m = 1
d = exp - ed
while m < 10:
    m += 1
    exp *= 1.03
    d += exp - ed

d = round(d, 2)
print('Студенту надо попросить', d, 'рублей.')

educational_grant = float(input('Введите размер дохода: '))
expenses = float(input('Введите сумму расходов: '))

inflation = 1.03
month = 1
while month < 10:
    month += 1
    expenses += expenses * inflation
credit = round(expenses - educational_grant*10, 2)
print('------Студенту надо попросить', credit, 'рублей.')




