# print("1 == 1:", 1 == 1)
# print("1 == 2:", 1 == 2)
#
# print("1 != 1:", 1 != 1)
#
# print("1 != 2:", 1 != 2)
#
# print("1 > 1:", 1 > 1)
# print("1 > 2:", 1 > 2)
#
# print("2 > 1:", 2 > 1)
#
# print("1 < 1:", 1 < 1)
#
# print("1 < 2:", 1 < 2)
# print("2 < 1:", 2 < 1)
#
# print("1 >= 1:", 1 >= 1)
# print("1 >= 2:", 1 >= 2)
# # |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
#
# print(bool(""))
# print(bool(0.0))
# print(bool(None))
# print(bool("IT Step Academy"))
# print(bool(1))
# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
# print('Я' > 'А')
# print('Кот' > 'Код')
# print('Сонный' > 'Сон')
# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||

# x = -5
#
# if x < 0:
#     print("x отрицательное число")
# if x >= 0:
#     print("x неотрицательное число")
# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||

# x = -5
#
# if x < 0:
#     print("x отрицательное число")
# else:
#     print("x неотрицательное число")

# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||

# if x < 0:
#     print("x отрицательное число")
# elif x > 0:
#     print("x положительное число")
# else:
#     print("x равен 0")
# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||

# x = -10
# sgn = 0
#
# if x < 0:
#     sgn = -1
#     print("x отрицательное число", sgn)
# elif x > 0:
#     sgn = 1
#     print("x положительное число", sgn)
# else:
#     print("x равен 0", sgn)

# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
# age = 18
# accessAllowed = True if age >= 18 else False
# print(accessAllowed)

# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
# x = 4
# if x >= 2 and x <= 7:
#     print("x попадает в [2; 7]")
# else:
#     print("x не попадает в [2; 7]")
#
# x = 4

# # Упрощение сравнения по цепочке
# if 2 <= x <= 7:
#     print("x попадает в [2; 7]")
# else:
#     print("x не попадает в [2; 7]")

# x = 40
# if x < 2 or x > 7:
#     print("x не попадает в [2; 7]")
# else:
#     print("x попадает в [2; 7]")

x = 4
y = -2
if x >= 2 and x <= 7 and (y < 0 or y > 5):  #if 2 <= x <= 7 and (y < 0 or y > 5):
    print("x попадает в [2; 7], y не попадает в [0; 5]")

# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||


# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||






























