# print("1 == 1:", 1 == 1)
# print("1 == 2:", 1 == 2)
#
# print("1 != 1:", 1 != 1)
#
# print("1 != 2:", 1 != 2)
#
# print("1 > 1:", 1 > 1)
# print("1 > 2:", 1 > 2)
#
# print("2 > 1:", 2 > 1)
#
# print("1 < 1:", 1 < 1)
#
# print("1 < 2:", 1 < 2)
# print("2 < 1:", 2 < 1)
#
# print("1 >= 1:", 1 >= 1)
# print("1 >= 2:", 1 >= 2)
# # |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
#
# print(bool([0]))
# print(bool(0.0))
# print(bool(None))
# print(bool("IT Step Academy"))
# print(bool(1))
# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
# print('Я' > 'Аhgfj')
# # print('Кот' > 'Код')
# print('a' < 'а')
# print('a' > 'а')
# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
#
# x = 5
#
# if x < 0:
#     print("x отрицательное число")
# if x >= 0:
#     print("x неотрицательное число")
# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||

# x = -5
#
# if x < 0:
#     print("x отрицательное число")
# else:
#     print("x неотрицательное число")

# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
# x = -5
#
# if x < 0:
#     print("x отрицательное число")
# elif x > 0:
#     print("x положительное число")
# else:
#     print("x равен 0")
# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||

# x = 0
# sgn = 0
#
# if x < 0:
#     sgn = -1
#     print("x отрицательное число", sgn)
# elif x > 0:
#     sgn = 1
#     print("x положительное число", sgn)
# else:
#     print("x равен 0", sgn)

# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
# age = 18
# accessAllowed = True if age >= 18 else False
# print(accessAllowed)

# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
# x = 1

# if x >= 2 and x <= 7:
#     print("x попадает в [2; 7]")
# else:
#     print("x не попадает в [2; 7]")
#
#
#
# # # Упрощение сравнения по цепочке
# x = 4
# if 2 <= x <= 7:
#     print("x попадает в [2; 7]")
# else:
#     print("x не попадает в [2; 7]")

# x = 40
# if x < 2 or x > 7:
#     print("x не попадает в [2; 7]")
# else:
#     print("x попадает в [2; 7]")

# x = 4
# y = -2
# if x >= 2 and x <= 7 and (y < 0 or y > 5):  #if 2 <= x <= 7 and (y < 0 or y > 5):
#     print("x попадает в [2; 7], y не попадает в [0; 5]")

# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
# number = int(input("Введите номер ответа: "))
# if number == 1:
#     print("Вы выбрали ответ A")
# else:
#     if number == 2:
#         print("Вы выбрали ответ B")
#     else:
#         if number == 3:
#             print("Вы выбрали ответ C")
#         else:
#             if number == 4:
#                 print("Вы выбрали ответ D")
#             else:
#                 print("нет такого ответа.")
#
# number = int(input("Введите номер ответа:  "))
# if number == 1:
#     print("Вы выбрали ответ A")
# elif number == 2:
#     print("Вы выбрали ответ B")
# elif number == 3:
#     print("Вы выбрали ответ C")
# elif number == 4:
#     print("Вы выбрали ответ D")
# else:
#     print("нет такого ответа.")

# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||
# Одиночные проверки

# x = 4
# y = True
# z = False
#
# if x:
#     print("x = ", x, " дает true")
# #
# if not 0:
#     print("0 дает false")
#
# if "0":
#     print("строка 0 дает true")
#
# if not "":
#     print("пустая строка дает false")
#
# if y:
#     print("y = true дает true")
#
# if not z:
#     print("z = false дает false")

# Пользователь вводит с клавиатуры два числа.
# В зависимости от выбора пользователя нужно показать
# сумму двух чисел, разницу двух чисел, среднеарифметическое или произведение двух чисел.

first = float(input('Введите первое число: '))
second = float(input('Введите второе число: '))



print('Если вы хотите получить:\n'
      'сумму двух чисел - нажмите - 1\n'
      'разницу двух чисел нажмите - 2\n'
      'произведение двух чисел нажмите - 3')

choice = input('Ваш выбор: ')

if choice == '1':
    res_1 = first + second
    print('сумма чисел: ', res_1)
elif choice == '2':
    res_2 = first - second
    print('разница чисел: ', res_2)
elif choice == '3':
    res_3 = first * second
    print('произведение чисел: ', res_3)
else:
    print('сам дурак')
























